{
  "personnages": [
    {
      "id_personnage": 1,
      "nom": "Mario",
      "types_personnage": {
        "id": 1
      },
      "description": "Mario est un plombier italien et l'un des personnages les plus emblématiques de l'histoire des jeux vidéo. Il est principalement connu pour ses aventures dans le Royaume Champignon, où il sauve souvent la princesse Peach des griffes de Bowser.",
      "image": "mario.png"
    },
    {
      "id_personnage": 2,
      "nom": "Luke Skywalker",
      "types_personnage": {
        "id": 2
      },
      "description": "Luke Skywalker est un personnage central de la saga Star Wars. Il est un jeune fermier de la planète Tatooine qui devient un Chevalier Jedi et joue un rôle crucial dans la lutte contre l'Empire Galactique.",
      "image": "luke_skywalker.png"
    },
    {
      "id_personnage": 3,
      "nom": "Link",
      "types_personnage": {
        "id": 1
      },
      "description": "Link est le héros principal de la série de jeux vidéo The Legend of Zelda. Il est souvent chargé de sauver la princesse Zelda et le royaume d'Hyrule des forces maléfiques, notamment Ganon.",
      "image": "link.png"
    },
    {
      "id_personnage": 4,
      "nom": "Indiana Jones",
      "types_personnage": {
        "id": 2      
      },
      "description": "Indiana Jones est un archéologue et aventurier fictif, célèbre pour ses exploits dans la série de films d'aventure portant son nom. Il est souvent impliqué dans la recherche d'artefacts anciens tout en affrontant des adversaires dangereux.",
      "image": "indiana_jones.png"
    },
    {
      "id_personnage": 5,
      "nom": "Master Chief",
      "types_personnage": {
        "id": 1
      },
      "description": "Master Chief est le protagoniste principal de la série de jeux vidéo Halo. Il est un super-soldat génétiquement amélioré et est souvent chargé de défendre l'humanité contre les menaces extraterrestres, en particulier les Covenants.",
      "image": "master_chief.png"
    },
    {
      "id_personnage": 6,
      "nom": "Jon Snow",
      "types_personnage": {
        "id": 3
      },
      "description": "Jon Snow est un personnage principal de la série télévisée Game of Thrones. Il est membre de la Garde de Nuit et est souvent impliqué dans les intrigues politiques et militaires de Westeros.",
      "image": "jon_snow.png"
    },
    {
      "id_personnage": 7,
      "nom": "Darth Vader",
      "types_personnage": {
        "id": 2
      },
      "description": "Darth Vader est l'un des méchants les plus emblématiques de la saga Star Wars. Autrefois connu sous le nom d'Anakin Skywalker, il est devenu un Seigneur Sith après avoir été corrompu par le Côté Obscur de la Force.",
      "image": "darth_vader.png"
    },
    {
      "id_personnage": 8,
      "nom": "Geralt de Riv",
      "types_personnage": {
        "id": 1
      },
      "description": "Geralt de Riv est le protagoniste principal de la série de jeux vidéo The Witcher. Il est un sorceleur, un chasseur de monstres professionnel, et est souvent impliqué dans des quêtes périlleuses et des intrigues politiques.",
      "image": "geralt_de_riv.png"
    },
    {
      "id_personnage": 9,
      "nom": "Ellie",
      "types_personnage": {
        "id": 1
      },
      "description": "Ellie est l'un des personnages principaux de la série de jeux vidéo The Last of Us. Elle est une jeune fille immunisée contre un virus mortel et est souvent accompagnée de Joel, un survivant endurci, dans un monde post-apocalyptique.",
      "image": "ellie.png"
    },
    {
      "id_personnage": 10,
      "nom": "Walter White",
      "types_personnage": {
        "id": 3
      },
      "description": "Walter White est le personnage principal de la série télévisée Breaking Bad. Il est un professeur de chimie devenu fabricant de méthamphétamine et est souvent impliqué dans des activités criminelles pour subvenir aux besoins de sa famille.",
      "image": "walter_white.png"
    },
    {
      "id_personnage": 11,
      "nom": "Nathan Drake",
      "types_personnage": {
        "id": 1
      },
      "description": "Nathan Drake est le protagoniste principal de la série de jeux vidéo Uncharted. Il est un chasseur de trésors intrépide et est souvent impliqué dans des aventures périlleuses à travers le monde.",
      "image": "nathan_drake.png"
    },
    {
      "id_personnage": 12,
      "nom": "Tony Stark",
      "types_personnage": {
        "id": 2
      },
      "description": "Tony Stark est le milliardaire philanthrope derrière l'identité secrète d'Iron",
      "image": "tony_stark.png"
    },
    {
      "id_personnage": 13,
      "nom": "Ellen Ripley",
      "types_personnage": {
        "id": 2
      },
      "description": "Ellen Ripley est l'héroïne de la série de films Alien. Elle est une officier de vaisseau spatial qui affronte des créatures extraterrestres mortelles et est souvent la seule survivante de ses missions.",
      "image": "ellen_ripley.png"
    },
    {
      "id_personnage": 14,
      "nom": "Gandalf",
      "types_personnage": {
        "id": 2
      },
      "description": "Gandalf est un puissant sorcier de la Terre du Milieu, créée par l'écrivain J.R.R. Tolkien. Il est souvent impliqué dans la lutte contre les forces du mal, en particulier Sauron, le Seigneur des Ténèbres.",
      "image": "gandalf.png"
    },
    {
      "id_personnage": 15,
      "nom": "Lara Croft",
      "types_personnage": {
        "id": 1
      },
      "description": "Lara Croft est l'héroïne de la série de jeux vidéo Tomb Raider. Elle est une archéologue et aventurière intrépide, souvent impliquée dans la recherche d'artefacts anciens tout en affrontant des ennemis dangereux.",
      "image": "lara_croft.png"
    },
    {
      "id_personnage": 16,
      "nom": "Harry Potter",
      "types_personnage": {
        "id": 2
      },
      "description": "Harry Potter est le protagoniste de la série de livres et de films du même nom, créée par l'écrivaine J.K. Rowling. Il est un jeune sorcier qui affronte le mage noir Lord Voldemort et ses partisans, les Mangemorts.",
      "image": "harry_potter.png"
    },
    {
      "id_personnage": 17,
      "nom": "James Bond",
      "types_personnage": {
        "id": 2
      },
      "description": "James Bond est un agent secret britannique fictif, créé par l'écrivain Ian Fleming. Il est souvent impliqué dans des missions périlleuses pour contrer les plans des méchants et sauver le monde.",
      "image": "james_bond.png"
    }
  ],
  "types_personnage": [
    {
      "id": 1,
      "nom": "Jeux Vidéo"
    },
    {
      "id": 2,
      "nom": "Film"
    },
    {
      "id": 3,
      "nom": "Série Télévisée"
    }
  ],
  "commentaires":[
    {
      "id": 1,
      "id_personnage": 1,
      "description": "Mario est un personnage emblématique, mais ses jeux peuvent parfois être répétitifs."
    },
    {
      "id": 2,
      "id_personnage": 2,
      "description": "Luke Skywalker est un personnage emblématique de la saga Star Wars et joue un rôle crucial dans l'histoire."
    },
    {
      "id": 3,
      "id_personnage": 3,
      "description": "Link est un héros courageux et ses aventures sont toujours passionnantes."
    },
    {
      "id": 4,
      "id_personnage": 4,
      "description": "Indiana Jones est un aventurier intrépide et ses films sont des classiques du genre."
    },
    {
      "id": 5,
      "id_personnage" : 5,
      "description": "Master Chief est un super-soldat impressionnant et ses jeux offrent une action intense."
    },
    {
      "id": 6,
      "id_personnage": 6,
      "description": "Jon Snow est un personnage complexe et fascinant, et il est l'un des points forts de Game of Thrones."
    }


  ],
  "notes": [
    {
        "idNote": 1,
        "id_personnage": 1,
        "id_user": 1,
        "note": 5
    },
    {
        "idNote": 2,
        "id_personnage": 2,
        "id_user": 2,
        "note": 4
    },
    {
        "idNote": 3,
        "id_personnage": 3,
        "id_user": 3,
        "note": 3
    },
    {
        "idNote": 4,
        "id_personnage": 4,
        "id_user": 4,
        "note": 2
    },
    {
        "idNote": 5,
        "id_personnage": 5,
        "id_user": 5,
        "note": 1
    }
]
}
