{
  "personnages": [
    {
      "id": 1,
      "nom": "Mario",
      "types_personnage": {
        "id": 1
      },
      "description": "Mario est un plombier italien et l'un des personnages les plus emblématiques de l'histoire des jeux vidéo. Il est principalement connu pour ses aventures dans le Royaume Champignon, où il sauve souvent la princesse Peach des griffes de Bowser.",
      "notes": [],
      "image": "https://exemple.com/images/mario.jpg"
    },
    {
      "id": 2,
      "nom": "Luke Skywalker",
      "types_personnage": {
        "id": 2
      },
      "description": "Luke Skywalker est un personnage central de la saga Star Wars. Il est un jeune fermier de la planète Tatooine qui devient un Chevalier Jedi et joue un rôle crucial dans la lutte contre l'Empire Galactique.",
      "notes": [],
      "image": "https://exemple.com/images/luke_skywalker.jpg"
    },
    {
      "id": 3,
      "nom": "Link",
      "types_personnage": {
        "id": 1
      },
      "description": "Link est le héros principal de la série de jeux vidéo The Legend of Zelda. Il est souvent chargé de sauver la princesse Zelda et le royaume d'Hyrule des forces maléfiques, notamment Ganon.",
      "notes": [],
      "image": "https://exemple.com/images/link.jpg"
    },
    {
      "id": 4,
      "nom": "Indiana Jones",
      "types_personnage": {
        "id": 2      
      },
      "description": "Indiana Jones est un archéologue et aventurier fictif, célèbre pour ses exploits dans la série de films d'aventure portant son nom. Il est souvent impliqué dans la recherche d'artefacts anciens tout en affrontant des adversaires dangereux.",
      "notes": [],
      "image": "https://exemple.com/images/indiana_jones.jpg"
    },
    {
      "id": 5,
      "nom": "Master Chief",
      "types_personnage": {
        "id": 1
      },
      "description": "Master Chief est le protagoniste principal de la série de jeux vidéo Halo. Il est un super-soldat génétiquement amélioré et est souvent chargé de défendre l'humanité contre les menaces extraterrestres, en particulier les Covenants.",
      "notes": [],
      "image": "https://exemple.com/images/master_chief.jpg"
    },
    {
      "id": 6,
      "nom": "Jon Snow",
      "types_personnage": {
        "id": 3
      },
      "description": "Jon Snow est un personnage principal de la série télévisée Game of Thrones. Il est membre de la Garde de Nuit et est souvent impliqué dans les intrigues politiques et militaires de Westeros.",
      "notes": [],
      "image": "https://exemple.com/images/jon_snow.jpg"
    }
  ],
  "types_personnage": [
    {
      "id": 1,
      "nom": "Jeux Vidéo"
    },
    {
      "id": 2,
      "nom": "Film"
    },
    {
      "id": 3,
      "nom": "Série Télévisée"
    }
  ]
}
